"""

Домашнее задание №1

Условный оператор: Возраст

* Попросить пользователя ввести возраст при помощи input и положить 
  результат в переменную
* Написать функцию, которая по возрасту определит, чем должен заниматься пользователь: 
  учиться в детском саду, школе, ВУЗе или работать
* Вызвать функцию, передав ей возраст пользователя и положить результат 
  работы функции в переменную
* Вывести содержимое переменной на экран

"""

def main():
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """

    age = int (input("Сколько Вам лет? "))

    def what_u_should_do(age):
    
      if age < 7:
        return "Вы должны учиться в детском саду"
      elif age >= 7 and age < 18:
        return "Вы должны учиться в школе"
      else:
        return "Вы должны работать"

    result = what_u_should_do(age)
    return result

if __name__ == "__main__":
    main()
